In [1]:
import pandas as pd
import numpy as np

In [10]:
#Создание Series

a = np.random.random(13)
my_series = pd.Series(a)
my_series

0     0.074184
1     0.479343
2     0.514333
3     0.568597
4     0.938174
5     0.062182
6     0.536368
7     0.784970
8     0.182766
9     0.413603
10    0.622399
11    0.695184
12    0.061231
dtype: float64

In [12]:
#Создание DataFrame

df = pd.DataFrame({
    'name': ['John', 'Kris', 'Nancy', 'Pablo'],
    'age': [32, 25, 18, 48],
    'country': ['USA', 'UK', 'Canada', 'Mexico'],
})

df

    name  age country
0   John   32     USA
1   Kris   25      UK
2  Nancy   18  Canada
3  Pablo   48  Mexico

In [13]:
df.name

0     John
1     Kris
2    Nancy
3    Pablo
Name: name, dtype: object

In [15]:
df.index = ['USA', 'UK', 'Canada', 'Mexico']

In [16]:
df.index

Index(['USA', 'UK', 'Canada', 'Mexico'], dtype='object')

In [17]:
df

         name  age country
USA      John   32     USA
UK       Kris   25      UK
Canada  Nancy   18  Canada
Mexico  Pablo   48  Mexico

In [29]:
df.loc['USA']

name       John
age          32
country     USA
Name: USA, dtype: object

In [30]:
df.age > 18

USA        True
UK         True
Canada    False
Mexico     True
Name: age, dtype: bool

In [31]:
df[df.age > 18]

         name  age country
USA      John   32     USA
UK       Kris   25      UK
Mexico  Pablo   48  Mexico

In [37]:
df[((df.country == 'UK') | (df.country == 'Mexico')) & (df.age > 18)]

         name  age country
UK       Kris   25      UK
Mexico  Pablo   48  Mexico

In [38]:
df['salary'] = [0, 10000, 4200, 1000000]
df

         name  age country   salary
USA      John   32     USA        0
UK       Kris   25      UK    10000
Canada  Nancy   18  Canada     4200
Mexico  Pablo   48  Mexico  1000000

In [42]:
df.drop(['salary'], axis = 1, inplace = True)
df

         name  age country
USA      John   32     USA
UK       Kris   25      UK
Canada  Nancy   18  Canada
Mexico  Pablo   48  Mexico

In [43]:
df.drop(['UK'], axis = 0, inplace = True)
df

         name  age country
USA      John   32     USA
Canada  Nancy   18  Canada
Mexico  Pablo   48  Mexico

In [45]:
df.rename(columns={'name': 'first_name'}, inplace = True)
df

       first_name  age country
USA          John   32     USA
Canada      Nancy   18  Canada
Mexico      Pablo   48  Mexico

In [46]:
df.nlargest(2, 'age')

       first_name  age country
Mexico      Pablo   48  Mexico
USA          John   32     USA

In [47]:
df.nsmallest(2, 'age')

       first_name  age country
Canada      Nancy   18  Canada
USA          John   32     USA